app/controllers/file_attachments_controller.rb

SELECT * FROM `file_attachments` WHERE (`file_attachments`.`id` = 32)
---
  def load_file_attachment
    @file_attachment = FileAttachment.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
INSERT INTO `file_attachments` (`attachment_file_file_size`, `user_id`, `attachment_file_file_content_type`, `attachment_file_file_updated_at`, `attachment_file_file_file_name`) VALUES(1264, NULL, NULL, NULL, NULL)
---
  def create
    @user = User.find(params[:user_id])
    if @file_attachment.save