app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-06-16 15:21:24', '02aeafe57dd8c31e2deea8226fd7595539497db15a4c59df806cc7fe52387c7a5681e2286c9d162a9f513509492caf8976dafaf5746493812abdf351f9518b23', '2010-06-16 15:21:24', 'rclements', 'obxAcTYhY9Rz7SSdKR1K', 'b39030b556c5d6e33c263b322fcdfeb93774b2085d2a4fe0a669f37fab1f207d0bc9c9ae6ad939a82bbaacac06b13e860f3ba584581708673524beed905c249d', 'rclements@isotope11.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "persistence_token" = '8297970c98de15ea9d7204aa07921330e81526ca05fc9cb388b3d627b011c223f5d41d010a41eba0be93ffa3c31a723eea4ce411f4e630c44acd7e1279b0e935', "updated_at" = '2010-06-22 14:29:17', "username" = 'jsmith', "password_salt" = 'jDSHmhxaKxTKUJkXqrAk', "crypted_password" = 'f5ebca395da4def85997c8f698ed0ad60a04d3098048d63f02a7bd65e1503de8e614b5299f72928cf214baff944393ddee851dd18c5fd9decfa981997ba1c7de' WHERE "id" = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])